DataProcessors/ЗаполнениеСправочникаСобираемость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеСправочникаСобираемость</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СобираемостьГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобираемостьГод</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/СобираемостьГод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СобираемостьГод</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПортфелиСодержание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесЯнварь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяЯнварь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесФевраль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяФевраль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесМарт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяМарт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесАпрель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяАпрель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесМай</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяМай</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесИюнь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяИюнь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесИюль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяИюль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесАвгуст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяАвгуст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесСентябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяСентябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесОктябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяОктябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесНоябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяНоябрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирМесДекабрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобирОбщаяДекабрь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗаполнениеСправочникаСобираемость/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РасчитатьНаСервере()
	 
	  ссылкаГод=Неопределено;
	  
	  ссылкиМассив=Новый Массив;
	  
	    Если  ВыборГода<>""  Тогда
			
			  Если НеПересчитыватьДобавить Тогда
				  
				   
				  //  проверю есть ли такой год
				  естьГод=Ложь;
				  
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	СобираемостьГод.Год КАК Год
							|ИЗ
							|	Справочник.СобираемостьГод КАК СобираемостьГод
							|ГДЕ
							|	СобираемостьГод.Год = &Год";
						
						Запрос.УстановитьПараметр("Год", ВыборГода);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Если ВыборкаДетальныеЗаписи.Количество()>0  Тогда
						
							  естьГод=Истина;
							  
					    Иначе
																
									ЗаписьСп=Справочники.СобираемостьГод.СоздатьЭлемент();
									
									ЗаписьСп.Год=ВыборГода;
									ЗаписьСп.Наименование=ВыборГода;
									
									ЗаписьСп.Записать();
									
						
						КонецЕсли;
									  
						
						
						// Добавлю портфели
						
							
							Запрос = Новый Запрос;
							Запрос.Текст = 
								"ВЫБРАТЬ
								|	ПортфелиСодержание.Ссылка КАК Ссылка
								|ИЗ
								|	Справочник.ПортфелиСодержание КАК ПортфелиСодержание";
							
							РезультатЗапроса = Запрос.Выполнить();
							
							ВыборкаПортфели = РезультатЗапроса.Выбрать();
							
							Пока ВыборкаПортфели.Следующий() Цикл
								
								         	
											Запрос = Новый Запрос;
											Запрос.Текст = 
												"ВЫБРАТЬ
												|	СобираемостьГод.Ссылка КАК Ссылка,
												|	СобираемостьГод.Год КАК Год
												|ИЗ
												|	Справочник.СобираемостьГод КАК СобираемостьГод
												|ГДЕ
												|	СобираемостьГод.Портфель = &Портфель";
											
											Запрос.УстановитьПараметр("Портфель", ВыборкаПортфели.Ссылка);
											
											РезультатЗапроса = Запрос.Выполнить();
											
											ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
											
											Если ВыборкаДетальныеЗаписи.Количество()=0  Тогда
												
												    ЗаписьСп=Справочники.СобираемостьГод.СоздатьЭлемент();
														
													ЗаписьСп.Год=ВыборГода;
													ЗаписьСп.Наименование=ВыборГода;
														
													ЗаписьСп.Портфель=ВыборкаПортфели.Ссылка;
														
														
													ЗаписьСп.Записать();
														
													ссылкиМассив.Добавить(ЗаписьСп);
													
											
											КонецЕсли;
								
								
								
							КонецЦикла;
							
							
								// Посчитаю Собираемость по этому году по месяцам
						
						 Для каждого стр Из ссылкиМассив Цикл
							 
							 
							 
						    январьНачало=стр.Год+"0101"; 
							январьНачалоД=Дата(январьНачало);
							
							январьКонец=стр.Год+"0131"; 
							январьКонецД=Дата(январьКонец);
							
							
							февральНачало=стр.Год+"0101"; 
							февральНачалоД=Дата(февральНачало);
							
							
							ЧислоДнейФевраль=День(КонецМесяца(Дата(стр.Год,2,1,1,1,1)));
							
							февральКонец=стр.Год+"02"+Строка(ЧислоДнейФевраль); 
							февральКонецД=Дата(февральКонец);
							
							
							мартНачало=стр.Год+"0301"; 
							мартНачалоД=Дата(мартНачало);
							
							мартКонец=стр.Год+"0331"; 
							мартКонецД=Дата(мартКонец);
							

							апрельНачало=стр.Год+"0401"; 
							апрельНачалоД=Дата(апрельНачало);
							
							апрельКонец=стр.Год+"0430"; 
							апрельКонецД=Дата(апрельКонец);
							
							
							майНачало=стр.Год+"0501"; 
							майНачалоД=Дата(майНачало);
							
							майКонец=стр.Год+"0531"; 
							майКонецД=Дата(майКонец);
							
							
							июньНачало=стр.Год+"0601"; 
							июньНачалоД=Дата(июньНачало);
							
							июньКонец=стр.Год+"0630"; 
							июньКонецД=Дата(июньКонец);
							
							
							июльНачало=стр.Год+"0701"; 
							июльНачалоД=Дата(июльНачало);
							
							июльКонец=стр.Год+"0731"; 
							июльКонецД=Дата(июльКонец);
							
							
							августНачало=стр.Год+"0801"; 
							августНачалоД=Дата(августНачало);
							
							августКонец=стр.Год+"0831"; 
							августКонецД=Дата(августКонец);
							
							
							
							сентябрьНачало=стр.Год+"0901"; 
							сентябрьНачалоД=Дата(сентябрьНачало);
							
							сентябрьКонец=стр.Год+"0930"; 
							сентябрьКонецД=Дата(сентябрьКонец);
							
							
							октябрьНачало=стр.Год+"1001"; 
							октябрьНачалоД=Дата(октябрьНачало);
							
							октябрьКонец=стр.Год+"1031"; 
							октябрьКонецД=Дата(октябрьКонец);
							
							
							ноябрьНачало=стр.Год+"1101"; 
							ноябрьНачалоД=Дата(ноябрьНачало);
							
							ноябрьКонец=стр.Год+"1130"; 
							ноябрьКонецД=Дата(ноябрьКонец);
							
							
							декабрьНачало=стр.Год+"1201"; 
							декабрьНачалоД=Дата(декабрьНачало);
							
							декабрьКонец=стр.Год+"1231"; 
							декабрьКонецД=Дата(декабрьКонец);
							
							
							
							
							
							
							стр.СобирМесЯнварь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,январьНачалоД,январьКонецД);
							стр.СобирМесФевраль=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,февральНачалоД,февральКонецД);
							стр.СобирМесМарт=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,мартНачалоД,мартКонецД);
							стр.СобирМесАпрель=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,апрельНачалоД,апрельКонецД);
							стр.СобирМесМай=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,майНачалоД,майКонецД);
							стр.СобирМесИюнь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,июньНачалоД,июньКонецД);
							стр.СобирМесИюль=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,июльНачалоД,июльКонецД);
							стр.СобирМесАвгуст=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,августНачалоД,августКонецД);
							стр.СобирМесСентябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,сентябрьНачалоД,сентябрьКонецД);
							
							стр.СобирМесОктябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,октябрьНачалоД,октябрьКонецД);
							
							стр.СобирМесНоябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,ноябрьНачалоД,ноябрьКонецД);
							
							стр.СобирМесДекабрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,декабрьНачалоД,декабрьКонецД);
							
							
							
							
							стр.СобирОбщаяЯнварь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,январьНачалоД,январьКонецД);
							стр.СобирОбщаяФевраль=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,февральНачалоД,февральКонецД);
							стр.СобирОбщаяМарт=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,мартНачалоД,мартКонецД);
							стр.СобирОбщаяАпрель=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,апрельНачалоД,апрельКонецД);
							
							стр.СобирОбщаяМай=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,майНачалоД,майКонецД);
							стр.СобирОбщаяИюнь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,июньНачалоД,июньКонецД);
							стр.СобирОбщаяИюль=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,июльНачалоД,июльКонецД);
							стр.СобирОбщаяАвгуст=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,августНачалоД,августКонецД);
							стр.СобирОбщаяСентябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,сентябрьНачалоД,сентябрьКонецД);
							
							стр.СобирОбщаяОктябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,октябрьНачалоД,октябрьКонецД);
							
							стр.СобирОбщаяНоябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,ноябрьНачалоД,ноябрьКонецД);
							
							стр.СобирОбщаяДекабрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,декабрьНачалоД,декабрьКонецД);
							
							
							
							
							
							
							
							
							 
							//портТ=стр.Портфель;		   
							   
							   
							   
							   
							   
							   
						    стр.Записать();
							   
						 	
						 
						 КонецЦикла;
								
								
			
			  	

							
												
						
						
						
						
						
			  	
			  
			  Иначе
				  
				        //  Очищу СобираемостьГод по этому году
	    			
						Запрос = Новый Запрос;
						Запрос.Текст = 
							"ВЫБРАТЬ
							|	СобираемостьГод.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.СобираемостьГод КАК СобираемостьГод
							|ГДЕ
							|	СобираемостьГод.Год = &Год";
						
						Запрос.УстановитьПараметр("Год", ВыборГода);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							// Вставить обработку выборки ВыборкаДетальныеЗаписи
							
						обУд=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
						
						обУд.Удалить();
							
						КонецЦикла;
						
									
					//  Создам   СобираемостьГод по этому году   Запишу все портфели 
						
								
								Запрос = Новый Запрос;
								Запрос.Текст = 
									"ВЫБРАТЬ
									|	ПортфелиСодержание.Ссылка КАК Ссылка
									|ИЗ
									|	Справочник.ПортфелиСодержание КАК ПортфелиСодержание";
								
								РезультатЗапроса = Запрос.Выполнить();
								
								ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
								
								Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
									// Вставить обработку выборки ВыборкаДетальныеЗаписи
									
									ЗаписьСп=Справочники.СобираемостьГод.СоздатьЭлемент();
									
									ЗаписьСп.Год=ВыборГода;
									ЗаписьСп.Наименование=ВыборГода;
									
									ЗаписьСп.Портфель=ВыборкаДетальныеЗаписи.Ссылка;
									
									
									ЗаписьСп.Записать();
									
									ссылкиМассив.Добавить(ЗаписьСп);
									
								КонецЦикла;
						
								
								
					     	
							
							
		
								
						// Посчитаю Собираемость по этому году по месяцам
						
						 Для каждого стр Из ссылкиМассив Цикл
							 
							 
							 
						    январьНачало=стр.Год+"0101"; 
							январьНачалоД=Дата(январьНачало);
							
							январьКонец=стр.Год+"0131"; 
							январьКонецД=Дата(январьКонец);
							
							
							февральНачало=стр.Год+"0101"; 
							февральНачалоД=Дата(февральНачало);
							
							
							ЧислоДнейФевраль=День(КонецМесяца(Дата(стр.Год,2,1,1,1,1)));
							
							февральКонец=стр.Год+"02"+Строка(ЧислоДнейФевраль); 
							февральКонецД=Дата(февральКонец);
							
							
							мартНачало=стр.Год+"0301"; 
							мартНачалоД=Дата(мартНачало);
							
							мартКонец=стр.Год+"0331"; 
							мартКонецД=Дата(мартКонец);
							

							апрельНачало=стр.Год+"0401"; 
							апрельНачалоД=Дата(апрельНачало);
							
							апрельКонец=стр.Год+"0430"; 
							апрельКонецД=Дата(апрельКонец);
							
							
							майНачало=стр.Год+"0501"; 
							майНачалоД=Дата(майНачало);
							
							майКонец=стр.Год+"0531"; 
							майКонецД=Дата(майКонец);
							
							
							июньНачало=стр.Год+"0601"; 
							июньНачалоД=Дата(июньНачало);
							
							июньКонец=стр.Год+"0630"; 
							июньКонецД=Дата(июньКонец);
							
							
							июльНачало=стр.Год+"0701"; 
							июльНачалоД=Дата(июльНачало);
							
							июльКонец=стр.Год+"0731"; 
							июльКонецД=Дата(июльКонец);
							
							
							августНачало=стр.Год+"0801"; 
							августНачалоД=Дата(августНачало);
							
							августКонец=стр.Год+"0831"; 
							августКонецД=Дата(августКонец);
							
							
							
							сентябрьНачало=стр.Год+"0901"; 
							сентябрьНачалоД=Дата(сентябрьНачало);
							
							сентябрьКонец=стр.Год+"0930"; 
							сентябрьКонецД=Дата(сентябрьКонец);
							
							
							октябрьНачало=стр.Год+"1001"; 
							октябрьНачалоД=Дата(октябрьНачало);
							
							октябрьКонец=стр.Год+"1031"; 
							октябрьКонецД=Дата(октябрьКонец);
							
							
							ноябрьНачало=стр.Год+"1101"; 
							ноябрьНачалоД=Дата(ноябрьНачало);
							
							ноябрьКонец=стр.Год+"1130"; 
							ноябрьКонецД=Дата(ноябрьКонец);
							
							
							декабрьНачало=стр.Год+"1201"; 
							декабрьНачалоД=Дата(декабрьНачало);
							
							декабрьКонец=стр.Год+"1231"; 
							декабрьКонецД=Дата(декабрьКонец);
							
							
							
							
							
							
							стр.СобирМесЯнварь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,январьНачалоД,январьКонецД);
							стр.СобирМесФевраль=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,февральНачалоД,февральКонецД);
							стр.СобирМесМарт=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,мартНачалоД,мартКонецД);
							стр.СобирМесАпрель=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,апрельНачалоД,апрельКонецД);
							стр.СобирМесМай=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,майНачалоД,майКонецД);
							стр.СобирМесИюнь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,июньНачалоД,июньКонецД);
							стр.СобирМесИюль=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,июльНачалоД,июльКонецД);
							стр.СобирМесАвгуст=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,августНачалоД,августКонецД);
							стр.СобирМесСентябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,сентябрьНачалоД,сентябрьКонецД);
							
							стр.СобирМесОктябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,октябрьНачалоД,октябрьКонецД);
							
							стр.СобирМесНоябрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,ноябрьНачалоД,ноябрьКонецД);
							
							стр.СобирМесДекабрь=ФункцииДляОтчетов.СуммаСобираемаяМесяц(стр.Портфель,декабрьНачалоД,декабрьКонецД);
							
							
							
							
							стр.СобирОбщаяЯнварь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,январьНачалоД,январьКонецД);
							стр.СобирОбщаяФевраль=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,февральНачалоД,февральКонецД);
							стр.СобирОбщаяМарт=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,мартНачалоД,мартКонецД);
							стр.СобирОбщаяАпрель=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,апрельНачалоД,апрельКонецД);
							
							стр.СобирОбщаяМай=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,майНачалоД,майКонецД);
							стр.СобирОбщаяИюнь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,июньНачалоД,июньКонецД);
							стр.СобирОбщаяИюль=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,июльНачалоД,июльКонецД);
							стр.СобирОбщаяАвгуст=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,августНачалоД,августКонецД);
							стр.СобирОбщаяСентябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,сентябрьНачалоД,сентябрьКонецД);
							
							стр.СобирОбщаяОктябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,октябрьНачалоД,октябрьКонецД);
							
							стр.СобирОбщаяНоябрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,ноябрьНачалоД,ноябрьКонецД);
							
							стр.СобирОбщаяДекабрь=ФункцииДляОтчетов.СуммаСобираемаяОбщаяНарИтогом(стр.Портфель,декабрьНачалоД,декабрьКонецД);
							
							
							
							
							
							
							
							
							 
							//портТ=стр.Портфель;		   
							   
							   
							   
							   
							   
							   
						    стр.Записать();
							   
						 	
						 
						 КонецЦикла;
								
								
			
			  	
			  
			  КонецЕсли;
			
		КонецЕсли;	    	
						  
	     Сообщить("Ок");
		  
		   	
КонецПроцедуры


  
  
  

&НаКлиенте
Процедура Расчитать(Команда)
	РасчитатьНаСервере();
КонецПроцедуры
